/**
 * @file mid_joyhat.h
 * @version 26080718.200
 */

#ifndef LOAD_MID_JOYHAT_H
#define LOAD_MID_JOYHAT_H

#include "main.h"
#include "cmn_setting.h"

//******************************************************
// グローバル型定義
//******************************************************

//******************************************************
// グローバル変数宣言
//******************************************************

//******************************************************
// グローバル関数宣言
//******************************************************

void joyhat_setup(void);
void joyhat_get_xyb(s2* ps2_x, s2* ps2_y, u1* pu1_b);

#endif /* LOAD_MID_JOYHAT_H */
